webshop/app/views/shared/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
      <ul class="nav navbar-nav">
        <% Category.all.each do |category|  %>