webshop/app/controllers/products_controller.rb

  def index
    @products = if params[:category_id]
                  Category.find(params[:category_id]).products
                else
                  Product.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = ?  [["category_id", 1]]
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)